---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ConduitSettings
source: html/10f6157d-7a69-1a57-ef72-8ef5e6c6fbc3.htm
---
# ConduitSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.